InformationRegisters/TG_ПерсональныеНастройкиУведомленийВTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>TG_ПерсональныеНастройкиУведомленийВTelegram</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УведомлятьВTelegramОНаправленииЗадачИсполнителю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/TG_СоответствияСотрудниковID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>TG_СоответствияСотрудниковID</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТелеграмId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВкючатьВСостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TG_СоставОсновныхПолейЗадачиПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/TG_Боты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>TG_Боты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаБота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/TG_ОтправкаУведомленийТелеграм/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОтправитьУведомленияПоЗадачамПроцесса(ДатаПоследнейРассылки, МассивПроектов, ПараметрыРассылки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	ЗадачиПроцесса.Ссылка                                           КАК Задача,
	|	ЗадачиПроцесса.Предмет.Наименование                             КАК НаименованиеВладельца,
	|	ЗадачиПроцесса.Предмет.Владелец.НаименованиеКонфигурации        КАК НаименованиеКонфигурации,
	|	ЗадачиПроцесса.Предмет.Владелец.КраткоеНаименованиеКонфигурации КАК КраткоеНаименованиеКонфигурации,
	|	ЗадачиПроцесса.Код                                              КАК Код,
	|	ЗадачиПроцесса.Описание                                         КАК Описание,
	|	ЗадачиПроцесса.Наименование                                     КАК Наименование,
	|	ЗадачиПроцессаПротоколВзаимодействия.Автор                      КАК Автор,
	|	ЗадачиПроцесса.Исполнитель                                      КАК Исполнитель,
	|   ЗадачиПроцесса.Контролирующий									КАК Контролирующий,
	| 	ЗадачиПроцесса.ПлановаяДатаНачала								КАК ПлановаяДатаНачала,
	|   ЗадачиПроцесса.Предмет                                          КАК Предмет,
	|	ЗадачиПроцесса.Статус                                           КАК Статус,
	|	ЗадачиПроцессаПротоколВзаимодействия.Дата                       КАК ДатаСоздания,
	|	ЗадачиПроцесса.КрайняяДатаОкончания                             КАК КрайняяДатаОкончания,
	|	ЕСТЬNULL(TG_СоответствияСотрудниковID.ТелеграмId, """") 		КАК ТелеграмId,
	|	ВЫБОР
	|		КОГДА ЗадачиПроцесса.Предмет ССЫЛКА Справочник.ФункцииМеханизмов
	|			ТОГДА ЗадачиПроцесса.Предмет.Владелец.Владелец
	|		КОГДА ЗадачиПроцесса.Предмет ССЫЛКА Справочник.СборкиВерсии
	|			ТОГДА ЗадачиПроцесса.Предмет.Владелец.Владелец
	|		ИНАЧЕ ЗадачиПроцесса.Предмет.Владелец
	|	КОНЕЦ КАК Проект
	|ИЗ
	|	Справочник.ЗадачиПроцесса.ПротоколВзаимодействия КАК ЗадачиПроцессаПротоколВзаимодействия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|		ПО ЗадачиПроцессаПротоколВзаимодействия.Ссылка = ЗадачиПроцесса.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TG_ПерсональныеНастройкиУведомленийВTelegram КАК ПерсональныеНастройкиУведомленийПользователей
	|		ПО (ЗадачиПроцесса.Исполнитель = ПерсональныеНастройкиУведомленийПользователей.Пользователь)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО (ЗадачиПроцесса.Исполнитель = Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TG_СоответствияСотрудниковID КАК TG_СоответствияСотрудниковID
	|		ПО (ЗадачиПроцесса.Исполнитель = TG_СоответствияСотрудниковID.Сотрудник)
	|ГДЕ
	|	ЗадачиПроцессаПротоколВзаимодействия.НомерСтроки = 1
	|	И ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована)
	|	И НЕ ЗадачиПроцесса.ПометкаУдаления
	|	И ЗадачиПроцесса.Исполнитель <> ЗадачиПроцессаПротоколВзаимодействия.Автор
	|	И ПерсональныеНастройкиУведомленийПользователей.УведомлятьВTelegramОНаправленииЗадачИсполнителю
	|	И НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|	И ЗадачиПроцессаПротоколВзаимодействия.Дата > &ДатаПоследнейРассылки
	|	И ЗадачиПроцессаПротоколВзаимодействия.Дата <= &ВерхняяГраницаПоДате
	|	И ЗадачиПроцесса.Предмет.Владелец В(&МассивПроектов)
	|	И ЗадачиПроцесса.ЗадачаШаблона = ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)
	|ИТОГИ ПО
	|	Задача";
	
	Запрос.УстановитьПараметр("ДатаПоследнейРассылки", ПараметрыРассылки.ДатаПоследнейРассылки);
	Запрос.УстановитьПараметр("ВерхняяГраницаПоДате", ПараметрыРассылки.ВерхняяГраницаПоДате);
	Запрос.УстановитьПараметр("МассивПроектов", МассивПроектов);
	
	ВыборкаЗадачи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗадачи.Следующий() Цикл
			
		РеквизитыЗадачи = Новый Структура;
		
		РеквизитыЗадачи.Вставить("Наименование", ВыборкаЗадачи.Задача);
		РеквизитыЗадачи.Вставить("Код", ВыборкаЗадачи.Код);
		РеквизитыЗадачи.Вставить("Статус", ВыборкаЗадачи.Статус);
		РеквизитыЗадачи.Вставить("Автор", Справочники.Пользователи.ПустаяСсылка());
		РеквизитыЗадачи.Вставить("Исполнитель", ВыборкаЗадачи.Исполнитель);
		РеквизитыЗадачи.Вставить("Контролирующий", ВыборкаЗадачи.Контролирующий);
		РеквизитыЗадачи.Вставить("Начало", ВыборкаЗадачи.ПлановаяДатаНачала);
		РеквизитыЗадачи.Вставить("Окончание", ВыборкаЗадачи.КрайняяДатаОкончания);
		НавигационнаяСсылка = СгенерироватьНавигационнуюСсылку(ВыборкаЗадачи.Задача, ПараметрыРассылки);
		РеквизитыЗадачи.Вставить("Описание", "");
		РеквизитыЗадачи.Вставить("Предмет", ВыборкаЗадачи.Предмет);
		РеквизитыЗадачи.Вставить("Проект", ВыборкаЗадачи.Проект);
		РеквизитыЗадачи.Вставить("СсылкаНаЗадачу", НавигационнаяСсылка);
		РеквизитыЗадачи.Вставить("ТелеграмId", "");
		
		ОписаниеЗадачи = ВыборкаЗадачи.Описание.Получить();
		Если ТипЗнч(ОписаниеЗадачи) = Тип("ФорматированныйДокумент") Тогда
			РеквизитыЗадачи.Описание = ОписаниеЗадачи.ПолучитьТекст();
		КонецЕсли;
				
		ВыборкаДетали = ВыборкаЗадачи.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			РеквизитыЗадачи.Автор        =  ВыборкаДетали.Автор;
			РеквизитыЗадачи.ТелеграмId = ВыборкаДетали.ТелеграмId;
						
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(РеквизитыЗадачи.ТелеграмId) Тогда
			ОтправитьСообщения(РеквизитыЗадачи);
			ДатаПоследнейРассылки = ТекущаяДатаСеанса();
		КонецЕсли; 
				
	КонецЦикла;
	
	Если ДатаПоследнейРассылки > Константы.ДатаПоследнейРассылки.Получить() Тогда
		Константы.ДатаПоследнейРассылки.Установить(ДатаПоследнейРассылки);
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщения(РеквизитыЗадачи)
	
	ДанныеОсновногоБота = ОсновнойТелеграмБот();
	
	Если ДанныеОсновногоБота = Неопределено Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка сообщения в telegram'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		"Не найден бот по умолчанию"); 
		
		Возврат;
		
	КонецЕсли;
	
	НастройкиПользователя = НастройкиСоставаПользователей();
	УдалитьНеиспользуемыеРеквизиты(НастройкиПользователя, РеквизитыЗадачи);
	
	Данные = Новый Структура;
	Если РеквизитыЗадачи.Свойство("Наименование") <> Неопределено Тогда
		Данные.Вставить("name", Строка(РеквизитыЗадачи.Задача));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Код") <> Неопределено Тогда
		Данные.Вставить("code", Строка(РеквизитыЗадачи.Код));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Статус") <> Неопределено Тогда
		Данные.Вставить("status", Строка(РеквизитыЗадачи.Статус));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Автор") <> Неопределено Тогда
		Данные.Вставить("author", Строка(РеквизитыЗадачи.Автор));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Исполнитель") <> Неопределено Тогда
		Данные.Вставить("executor", Строка(РеквизитыЗадачи.Исполнитель));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Контролирующий") <> Неопределено Тогда
		Данные.Вставить("controller", Строка(РеквизитыЗадачи.Контролирующий));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Начало") <> Неопределено Тогда
		ДатаНачала = ?(НЕ ЗначениеЗаполнено(РеквизитыЗадачи.Начало),
		"", Строка(РеквизитыЗадачи.Начало));
		Данные.Вставить("begin_date", РеквизитыЗадачи.Начало);
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Окончание") <> Неопределено Тогда
		ДатаОкончания = ?(НЕ ЗначениеЗаполнено(РеквизитыЗадачи.Окончание),
		"", Строка(РеквизитыЗадачи.Окончание));
		Данные.Вставить("end_date", ДатаОкончания);
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Предмет") <> Неопределено Тогда
		Данные.Вставить("subject", Строка(РеквизитыЗадачи.Предмет));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Проект") <> Неопределено Тогда
		Данные.Вставить("project", Строка(РеквизитыЗадачи.Проект));
	КонецЕсли;
	
	Если РеквизитыЗадачи.Свойство("Описание") <> Неопределено Тогда	
		Данные.Вставить("text", РеквизитыЗадачи.Описание);
	КонецЕсли;

	Данные.Вставить("external_ref", РеквизитыЗадачи.СсылкаНаЗадачу);
	Данные.Вставить("recipient_id", РеквизитыЗадачи.ТелеграмId);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ФайлТелаЗапроса = ПолучитьИмяВременногоФайла("json");
	ЗаписьJSON.ОткрытьФайл(ФайлТелаЗапроса);
	ЗаписатьJSON(ЗаписьJSON, Данные, Новый НастройкиСериализацииJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();
		
	Попытка
		ssl = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		HTTPСоединение = Новый HTTPСоединение(ДанныеОсновногоБота.АдресРазмещения,
		ДанныеОсновногоБота.Порт, , , , 40, ssl);
		Запрос = Новый HTTPЗапрос("/tasks");
		Запрос.Заголовки.Вставить("content-type", "application/json");
		Запрос.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(Запрос);     
		Сообщить(HTTPОтвет.КодСостояния);
		
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка сообщения в telegram'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
	КонецПопытки;
		
КонецПроцедуры

Функция ОсновнойТелеграмБот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TG_Боты.Порт КАК Порт,
	|	TG_Боты.АдресРазмещения КАК АдресРазмещения
	|ИЗ
	|	Справочник.TG_Боты КАК TG_Боты
	|ГДЕ
	|	TG_Боты.Основной = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("АдресРазмещения", Выборка.АдресРазмещения);
	Результат.Вставить("Порт", Выборка.Порт);
	
	Возврат Результат;
КонецФункции

Функция СгенерироватьНавигационнуюСсылку(Задача, ПараметрыРассылки)
		
	Если ЗначениеЗаполнено(Параметрырассылки.АдресИБВИнтернет) Тогда
		// Выводится внешняя ссылка
		Возврат НавигационнаяСсылкаДляУведомления(Задача, ПараметрыРассылки.АдресИБВИнтернет, Истина);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция НавигационнаяСсылкаДляУведомления(Ссылка, АдресПубликацииИБ, ВебПубликация=Ложь)
	
	АдресПубликацииИБ = СОКРЛП(АдресПубликацииИБ);
	
	Если ВебПубликация И Прав(АдресПубликацииИБ,1)<> "/" Тогда
		АдресПубликацииИБ = АдресПубликацииИБ + "/";
	КонецЕсли;
		
	Возврат АдресПубликацииИБ + "#" + ПолучитьНавигационнуюСсылку(Ссылка);
	
КонецФункции 

Функция НастройкиСоставаПользователей()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.РеквизитОбъекта КАК РеквизитОбъекта,
	|	TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.ВкючатьВСостав КАК ВкючатьВСостав
	|ИЗ
	|	РегистрСведений.TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса КАК TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса
	|ГДЕ
	|	TG_ПерсональныеНастройкиСоставаУведомленийПоЗадачамПроцесса.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Пользователи.ТекущийПользователь());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	НастройкиСостава = Новый Структура;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НастройкиСостава.Вставить(Выборка.РеквизитОбъекта, Выборка.ВкючатьВСостав);	
	КонецЦикла; 
	
	Возврат НастройкиСостава;
КонецФункции

Процедура УдалитьНеиспользуемыеРеквизиты(НастройкиПользователя, РеквизитыЗадачи)
	
	Для каждого КлючЗначение Из НастройкиПользователя Цикл
		Если КлючЗначение.Значение = Ложь Тогда
			Если РеквизитыЗадачи.Свойство(КлючЗначение.Ключ) Тогда
				РеквизитыЗадачи.Удалить(КлючЗначение.Ключ);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
 
 

#КонецОбласти
